package com.linkus.capital.util.enumtype.common;

/**=====================================================
 * 资产类型
 *=======================================================
 */
public enum AssetsTypeMode {
	
	/**
	 * 债券正回购资产
	 */
	T20005("FZ"),
	/**
	 * 债券逆回购资产
	 */
	T20012("FN"),
	/**
	 * 债券借贷融出资产
	 */
	T20054("RC"),
	/**
	 * 票据贴现
	 */
	T30001("DT"),
	/**
	 * 转贴买入
	 */
	T30003("RI"),
	/**
	 * 转贴卖出
	 */
	T30004("RO"),
	/**
	 * 再贴卖出
	 */
	T30005("AO"),
	/**
	 * 再贴回购
	 */
	T30006("AD"),
	/**
	 * 央行卖票
	 */
	T30007("AI"),
	/**
	 * 系统内转贴
	 */
	T30008("IR"),
	/**
	 * 票据逆回购
	 */
	T30009("FNA"),
	/**
	 * 票据正回购质押式
	 */
	T30010_POREPO("FZA"),
	
	/**票据正回购类质押式**/
	T30010_REREPOS("KZA"),
	/**
	 * 票据逆回购到期
	 */
	T30013("BD"),
	/**
	 * 票据再贴回购到期
	 */
	T30014("BA"),
	/**
	 * 票据正回购到期
	 */
	T30015("BB"),
	/**
	 * 代保管
	 */
	T30028("DBG"),
	/**
	 * 票据证券化质押
	 */
	T30029("ZY"),
	/**
	 * 票据证券化质押到期
	 */
	T30030("ZY"),
	/**
	 * 票据质押
	 */
	T30026("ZY"),
	/**
	 * 票据质押到期
	 */
	T30027("ZYB"),
	/**
	 * 票据逆回购赎回
	 */
	T30032("NS"),
	/**
	 * 票据正回购赎回
	 */
	T30011("BS"),
	/**
	 * 再贴回购赎回
	 */
	T30033("ZTNS"),
	/**
	 * 存放同业存入
	 */
	T50008("CTC"),
	/**
	 * 同业拆入资产
	 */
	T50006("TI"),
	/**
	 * 同业拆出资产
	 */
	T50007("TO"),
	/**
	 * 同业存放存入
	 */
	T50010("TCC"),
	/**
	 * 同业本行投资资产
	 */
	T50012("TT"),
	/**
	 * 同业存单发行
	 */
	T50031("CD");
	
	private String Code;
	
	private  AssetsTypeMode(String Code){
		this.Code = Code;
	}
	
	@Override
	public String toString(){
		return name();
	}
	
	public String getCode(){
		return this.Code;
	}
}